In [2]:
import pandas as pd
import numpy as np

In [1]:
data = {
'Name' : ['Priyang','Aadhya','Krishna','Vedant','Parshv','Mittal','Archana'] ,
'Marks' : [98 ,89,99,87,90,83,99],
'Gender' : ['Male','Female' ,'Female','Male','Male','Female','Female']
    
}

In [5]:
df = pd.DataFrame(data)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female

In [10]:
df.shape
df.size

21

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [13]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [20]:
df.isnull().sum(axis =0)

Name      0
Marks     0
Gender    0
dtype: int64

In [21]:
df.describe(include = "all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [22]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [23]:
df['Marks'].unique()

array([98, 89, 99, 87, 90, 83], dtype=int64)

In [24]:
df['Gender'].nunique()

2

In [25]:
df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [26]:
df['Marks'].value_counts()

99    2
98    1
89    1
87    1
90    1
83    1
Name: Marks, dtype: int64

In [27]:
df['Name'].value_counts()

Priyang    1
Aadhya     1
Krishna    1
Vedant     1
Parshv     1
Mittal     1
Archana    1
Name: Name, dtype: int64

In [35]:
x = (df['Marks']>= 90) & (df['Marks']<= 100)

In [37]:
df[x]

      Name  Marks  Gender
0  Priyang     98    Male
2  Krishna     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [38]:
df.loc[x,['Name','Gender']]

      Name  Gender
0  Priyang    Male
2  Krishna  Female
4   Parshv    Male
6  Archana  Female

In [40]:
sum(df['Marks'].between(90 ,100))

4

In [41]:
def marks(x):
    return x/2

In [45]:
df['Half_Marks'] = df['Marks'].apply(marks)
df

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2  Krishna     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [47]:
df['Marks'].apply(lambda x : x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [51]:
df['encode'] = df['Gender'].map({'Male':1 ,'Female':0})

In [52]:
df

      Name  Marks  Gender  Half_Marks  encode
0  Priyang     98    Male        49.0       1
1   Aadhya     89  Female        44.5       0
2  Krishna     99  Female        49.5       0
3   Vedant     87    Male        43.5       1
4   Parshv     90    Male        45.0       1
5   Mittal     83  Female        41.5       0
6  Archana     99  Female        49.5       0

In [55]:
df.drop('encode', axis =1)

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2  Krishna     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [62]:
m = (df['Gender'] == 'Female')
df[m][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2  Krishna     99
5   Mittal     83
6  Archana     99